In [1]:
import pandas as pd
import os

In [2]:
# Create the path and import the data
student_df = pd.read_csv('new_full_student_data.csv')

In [3]:
# Verify that the data was properly imported
student_df

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324
...,...,...,...,...,...,...,...,...
19509,109236636,Robert Sawyer,12th,Silva High School,43.3,27.2,Public,991918
19510,63239258,David Herman,9th,Woods High School,52.1,80.4,Public,912243
19511,95516554,Megan Gill,11th,Wagner High School,93.9,84.1,Public,846745
19512,65050383,Lori Stone,11th,Bowers High School,94.6,70.9,Public,848324
19513,34720657,Anna Jensen,12th,Montgomery High School,82.3,42.4,Charter,893368

In [4]:
print(student_df.columns)
# Check for null values
null_values = student_df.isnull()
print(null_values)
# Drop rows with null values and verify removal
student_df = student_df[student_df != 'False'].dropna()
student_df.head()

Index(['student_id', 'student_name', 'grade', 'school_name', 'reading_score',
       'math_score', 'school_type', 'school_budget'],
      dtype='object')
       student_id  student_name  grade  school_name  reading_score  \
0           False         False  False        False          False
1           False         False  False        False          False
2           False         False  False        False          False
3           False         False  False        False          False
4           False         False  False        False           True
...           ...           ...    ...          ...            ...
19509       False         False  False        False          False
19510       False         False  False        False          False
19511       False         False  False        False          False
19512       False         False  False        False          False
19513       False         False  False        False          False

       math_score  school_type  school_budget
0           False        False          False
1           False        False          False
2           False        False          False
3           False        False          False
4           False        False          False
...           ...          ...            ...
19509       False        False          False
19510       False        False          False
19511       False        False          False
19512       False        False          False
19513       False        False          False

[19514 rows x 8 columns]

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9th,Montgomery High School,63.5,76.9,Charter,893368

In [5]:
# Check for duplicated rows
student_df_noduplicates = student_df.duplicated()
print(student_df_noduplicates)

0        False
1        False
2        False
3        False
5        False
         ...
19509    False
19510     True
19511    False
19512    False
19513    False
Length: 16667, dtype: bool

In [6]:
# Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()
print(student_df)

       student_id      student_name grade             school_name  \
0       103880842     Travis Martin   9th    Sullivan High School
1        45069750     Michael Brown   9th       Dixon High School
2        45024902   Gabriela Lucero   9th      Wagner High School
3        62582498  Susan Richardson   9th       Silva High School
5        74579444   Cynthia Johnson   9th  Montgomery High School
...           ...               ...   ...                     ...
19508    83985333   Deborah Sanders  10th       Silva High School
19509   109236636     Robert Sawyer  12th       Silva High School
19511    95516554        Megan Gill  11th      Wagner High School
19512    65050383        Lori Stone  11th      Bowers High School
19513    34720657       Anna Jensen  12th  Montgomery High School

       reading_score  math_score school_type  school_budget
0               59.0        88.2      Public         961125
1               94.7        73.5     Charter         870334
2               89.0        70.4      Public         846745
3               69.7        80.3      Public         991918
5               63.5        76.9     Charter         893368
...              ...         ...         ...            ...
19508           60.5        64.6      Public         991918
19509           43.3        27.2      Public         991918
19511           93.9        84.1      Public         846745
19512           94.6        70.9      Public         848324
19513           82.3        42.4     Charter         893368

[14831 rows x 8 columns]

In [7]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [8]:
print(student_df['grade'].dtype)

object

In [9]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade']=student_df['grade'].str.replace('[^0-9\.]', '', regex=True)

In [10]:
student_df['grade'] = pd.to_numeric(student_df['grade'])

In [11]:
# Change the grade column to the int type and verify column types
print(student_df['grade'].dtype)
print(student_df['grade'])

int64
0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int64

In [13]:
# Display summary statistics for the DataFrame
student_df = pd.DataFrame(student_df)
print(student_df.describe())

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [14]:
# Display the mean math score using the mean function
mean_score = student_df['math_score'].mean()
print(mean_score)

64.67573326141189

In [15]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df['reading_score'].min()
print(min_reading_score)

10.5

In [16]:
# Use loc to display the grade column
grade_col = student_df.loc[:, 'grade']
print(grade_col)

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int64

In [18]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
subset = student_df.iloc[:3, 2:5]
print(subset)

   grade           school_name  reading_score
0      9  Sullivan High School           59.0
1      9     Dixon High School           94.7
2      9    Wagner High School           89.0

In [19]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
grade_nine_df = student_df.loc[student_df['grade'] == 9]
print(grade_nine_df.describe())

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [21]:
min_reading_score = student_df['reading_score'].min()
min_reading_row = student_df.loc[student_df['reading_score'] == min_reading_score]

In [22]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
dixon_10th_reading_scores = student_df.loc[(student_df['grade'] == 10) & (student_df['school_name'] == 'Dixon High School'), 'reading_score']

In [24]:
# Find the mean reading score for all students in grades 11 and 12 combined.
mean_reading1112 = (student_df['grade'] == 11) | (student_df['grade'] == 12)
mean_reading_score = student_df.loc[mean_reading1112, 'reading_score'].mean()
print(mean_reading_score)

74.90038089192188

In [26]:
# Group by school type and calculate the mean of reading and math scores
scores_by_type = student_df.groupby('school_type').mean()[['reading_score', 'math_score']]
print(scores_by_type)

             reading_score  math_score
school_type
Charter          72.450603   66.761883
Public           72.281219   62.951576

In [28]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.
student_count_by_school = student_df.groupby('school_name')['student_id'].count().sort_values(ascending=False)
print(student_count_by_school)

school_name
Montgomery High School    2038
Green High School         1961
Dixon High School         1583
Wagner High School        1541
Silva High School         1109
Woods High School         1052
Sullivan High School       971
Turner High School         846
Bowers High School         803
Fisher High School         798
Richard High School        551
Campos High School         541
Odonnell High School       459
Campbell High School       407
Chang High School          171
Name: student_id, dtype: int64

In [ ]:
# Deliverable 6: Summarize Your Findings
#By applying the the different methods from pandas I was able to jump into several conclusions regarding academic results in the data set provided.
#1 Charter schools schools tend to be better than public schools in the reading and math sectors, therefore we could conclude that school budget also has a direct impact in the students grades
#9th and 10th grade students tend to have better grades than juniors and seniors